// 구글 맵용 데이터
var marker = [{
         "Name": "스페인",
         "lat": 40.4378698,
         "lng": -3.8196189,
         "확진자수": 1,
         "사망자수": 0,
         "추가날짜":"2/2",
    }, {
         "Name": "스웨덴",
         "lat": 59.3260668,
         "lng": 17.8419725,
         "확진자수": 1,
         "사망자수": 0,
         "추가날짜":"2/2",
    },{
         "Name": "이탈리아",
         "lat": 41.902782,
         "lng": 12.496366,
         "확진자수": 2,
         "사망자수": 0,
         "추가날짜":"2/1",
    }, {
        "Name": "러시아",
        "lat": 55.751244,
        "lng": 37.618423,
        "확진자수": 2,
        "사망자수": 0,
        "추가날짜":"2/1",
    }, {
        "Name": "캐나다",
        "lat": 54.7235693,
        "lng": -113.7164202,
        "확진자수": 4,
        "사망자수": 0,
    }, {
        "Name": "미국",
        "lat": 37.2757368,
        "lng": -104.6549972,
        "확진자수": 11,
        "사망자수": 0,
    }, {
        "Name": "핀란드",
        "lat": 60.1102086,
        "lng": 24.7378224,
        "확진자수": 1,
        "사망자수": 0,
    }, {
        "Name": "프랑스",
        "lat": 46.1390503,
        "lng": -2.4346589,
        "확진자수": 6,
        "사망자수": 0,
    }, {
        "Name": "영국",
        "lat": 51.509865,
        "lng": -0.118092,
        "확진자수": 2,
        "사망자수": 0,
        "추가날짜":"2/1",
    }, {
        "Name": "네팔",
        "lat": 28.3838445,
        "lng": 81.8867804,
        "확진자수": 1,
        "사망자수": 0,
    }, {
        "Name": "마카오",
        "lat": 22.1619078,
        "lng": 113.5351333,
        "확진자수": 8,
        "사망자수": 0,
    }, {
        "Name": "홍콩",
        "lat": 22.3529808,
        "lng": 113.9876162,
        "확진자수": 14,
        "사망자수": 1,
    }, {
        "Name": "태국",
        "lat": 13.0110763,
        "lng": 96.9952628,
        "확진자수": 19,
        "사망자수": 0,
    }, {
        "Name": "호주",
        "lat": -24.9936027,
        "lng": 115.2351577,
        "확진자수": 12,
        "사망자수": 0,
    }, {
        "Name": "싱가포르",
        "lat": 1.3143394,
        "lng": 103.7041659,
        "확진자수": 18,
        "사망자수": 0,
    }, {
        "Name": "말레이시아",
        "lat": 4.1389178,
        "lng": 105.1226078,
        "확진자수": 8,
        "사망자수": 0,
    }, {
        "Name": "캄보디아",
        "lat": 12.1458696,
        "lng": 103.8594161,
        "확진자수": 1,
        "사망자수": 0,
    }, {
        "Name": "베트남",
        "lat": 15.7583637,
        "lng": 101.4157502,
        "확진자수": 8,
        "사망자수": 0,
    }, {
        "Name": "필리핀",
        "lat": 14.5965787,
        "lng": 120.9444545,
        "확진자수": 2,
        "사망자수": 1,
    }, {
        "Name": "대만",
        "lat": 25.0174719,
        "lng": 121.3662943,
        "확진자수": 10,
        "사망자수": 0,
    }, {
        "Name": "스리랑카",
        "lat": 7.8589214,
        "lng": 79.5850432,
        "확진자수": 1,
        "사망자수": 0,
    }, {
        "Name": "독일",
        "lat": 51.0968735,
        "lng": 5.9694438,
        "확진자수": 8,
        "사망자수": 0,
    }, {
        "Name": "인도",
        "lat": 28.5274228,
        "lng": 77.1387735,
        "확진자수": 3,
        "사망자수": 0,
    }, {
        "Name": "아랍에미리트",
        "lat": 24.3870789,
        "lng": 54.4185368,
        "확진자수": 5,
        "사망자수": 0,
    }, {
        "Name": "중국",
        "lat": 39.9385466,
        "lng": 116.117281,
        "확진자수": 20438,
        "사망자수": 425,
    }, {
        "Name": "일본",
        "lat": 34.6777642,
        "lng": 135.4160247,
        "확진자수": 16,
        "사망자수": 0,
    }, {
        "Name": "한국",
        "lat": 37.5456299,
        "lng": 126.9540667,
        "확진자수": 16,
        "사망자수": 0,
    }];

    // 선차트용 데이터
    var marker2 = {
      labels: ["1/24", "1/25", "1/26", "1/27", "1/28", "1/29", "1/30", "1/31", "2/1", "2/2", "2/3", "2/4"],
      data: [845, 1315, 2010, 2794, 4576, 6056, 7812, 9812, 11925, 14550, 17378, 20602]
    }

// 제주지역선별진료소
var 제주지역선별진료소 = [
    {
        "이름": "제주대학교병원",
        "lat": "33.4670605",
        "lng": "126.5370226",
        "주소": "제주 제주시 아란13길 15",
        "전화번호": "064-717-1075"
    },
    {
        "이름": "한마음병원",
        "lat": "33.4962918",
        "lng": "126.5374979",
        "주소": "제주 제주시 연신로 52",
        "전화번호": "064-750-9000"
    },
    {
        "이름": "서귀포의료원",
        "lat": "33.254995",
        "lng": "126.5625628",
        "주소": "제주 서귀포시 장수로 47",
        "전화번호": "064-730-3000"
    },
    {
        "이름": "한국병원",
        "lat": "33.5002078",
        "lng": "126.5148722",
        "주소": "제주 제주시 서광로 193",
        "전화번호": "064-750-0000"
    },
    {
        "이름": "제주한라병원",
        "lat": "33.4899863",
        "lng": "126.4829032",
        "주소": "제주 제주시 도령로 65",
        "전화번호": "064-740-5975"
    },
    {
        "이름": "중앙병원",
        "lat": "33.4922645",
        "lng": "126.4685369",
        "주소": "제주 제주시 월랑로 91",
        "전화번호": "064-786-7000"
    },
    {
        "이름": "서귀포열린병원",
        "lat": "33.2544248",
        "lng": "126.5632242",
        "주소": "제주 서귀포시 일주동로 8638",
        "전화번호": "064-762-8001"
    }
];
// 업데이트 일시 데이터
var updateLog = {
    date : "2/4",
    time : "14:00"
}
