var marker = [
    {
        "Name": "중국",
        "Name_ch": "中国",
        "Name_en": "China",
        "확진자수": 80701,
        "사망자수": 3097,
        "완치자수": 57315
    },
    {
        "Name": "이탈리아",
        "Name_ch": "义大利",
        "Name_en": "Italy",
        "확진자수": 5883,
        "사망자수": 233,
        "완치자수": 589
    },
    {
        "Name": "이란",
        "Name_ch": "伊朗",
        "Name_en": "Iran",
        "확진자수": 5823,
        "사망자수": 145,
        "완치자수": 1669
    },
    {
        "Name": "프랑스",
        "Name_ch": "法国",
        "Name_en": "France",
        "확진자수": 949,
        "사망자수": 16,
        "완치자수": 12
    },
    {
        "Name": "독일",
        "Name_ch": "德国",
        "Name_en": "Germany",
        "확진자수": 847,
        "사망자수": 0,
        "완치자수": 18
    },
    {
        "Name": "일본크루즈",
        "Name_ch": "日本 邮轮",
        "Name_en": "Diamond Princess",
        "확진자수": 696,
        "사망자수": 6,
        "완치자수": 245
    },
    {
        "Name": "스페인",
        "Name_ch": "西班牙",
        "Name_en": "Spain",
        "확진자수": 525,
        "사망자수": 10,
        "완치자수": 30
    },
    {
        "Name": "일본",
        "Name_ch": "日本",
        "Name_en": "Japan",
        "확진자수": 461,
        "사망자수": 6,
        "완치자수": 76
    },
    {
        "Name": "미국",
        "Name_ch": "美国",
        "Name_en": "United States",
        "확진자수": 447,
        "사망자수": 19,
        "완치자수": 15
    },
    {
        "Name": "스위스",
        "Name_ch": "瑞士",
        "Name_en": "Switzerland",
        "확진자수": 268,
        "사망자수": 1,
        "완치자수": 3
    },
    {
        "Name": "영국",
        "Name_ch": "英国",
        "Name_en": "UK",
        "확진자수": 209,
        "사망자수": 2,
        "완치자수": 18
    },
    {
        "Name": "네덜란드",
        "Name_ch": "荷兰",
        "Name_en": "Netherlands",
        "확진자수": 188,
        "사망자수": 1,
        "완치자수": 0
    },
    {
        "Name": "벨기에",
        "Name_ch": "比利时",
        "Name_en": "Belgium",
        "확진자수": 169,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "스웨덴",
        "Name_ch": "瑞典语",
        "Name_en": "Sweden",
        "확진자수": 161,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "노르웨이",
        "Name_ch": "挪威",
        "Name_en": "Norway",
        "확진자수": 157,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "싱가포르",
        "Name_ch": "新加坡",
        "Name_en": "Singapore",
        "확진자수": 138,
        "사망자수": 0,
        "완치자수": 90
    },
    {
        "Name": "홍콩",
        "Name_ch": "香港",
        "Name_en": "Hong Kong",
        "확진자수": 108,
        "사망자수": 2,
        "완치자수": 51
    },
    {
        "Name": "오스트리아",
        "Name_ch": "奥地利",
        "Name_en": "Austria",
        "확진자수": 104,
        "사망자수": 0,
        "완치자수": 2
    },
    {
        "Name": "말레이시아",
        "Name_ch": "马来西亚",
        "Name_en": "Malaysia",
        "확진자수": 93,
        "사망자수": 0,
        "완치자수": 23
    },
    {
        "Name": "바레인",
        "Name_ch": "巴林",
        "Name_en": "Bahrain",
        "확진자수": 85,
        "사망자수": 0,
        "완치자수": 6
    },
    {
        "Name": "호주",
        "Name_ch": "澳大利亚",
        "Name_en": "Australia",
        "확진자수": 80,
        "사망자수": 3,
        "완치자수": 22
    },
    {
        "Name": "그리스",
        "Name_ch": "希腊",
        "Name_en": "Greece",
        "확진자수": 66,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "쿠웨이트",
        "Name_ch": "科威特",
        "Name_en": "Kuwait",
        "확진자수": 62,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "캐나다",
        "Name_ch": "加拿大",
        "Name_en": "Canada",
        "확진자수": 60,
        "사망자수": 0,
        "완치자수": 8
    },
    {
        "Name": "이라크",
        "Name_ch": "伊拉克",
        "Name_en": "Iraq",
        "확진자수": 54,
        "사망자수": 4,
        "완치자수": 1
    },
    {
        "Name": "태국",
        "Name_ch": "泰国",
        "Name_en": "Thailand",
        "확진자수": 50,
        "사망자수": 1,
        "완치자수": 31
    },
    {
        "Name": "아일랜드",
        "Name_ch": "冰岛",
        "Name_en": "Iceland",
        "확진자수": 50,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "이집트",
        "Name_ch": "埃及",
        "Name_en": "Egypt",
        "확진자수": 48,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "대만",
        "Name_ch": "台湾",
        "Name_en": "Taiwan",
        "확진자수": 45,
        "사망자수": 1,
        "완치자수": 15
    },
    {
        "Name": "아랍에미리트",
        "Name_ch": "阿拉伯联合酋长国",
        "Name_en": "UAE",
        "확진자수": 45,
        "사망자수": 0,
        "완치자수": 7
    },
    {
        "Name": "인도",
        "Name_ch": "印度",
        "Name_en": "India",
        "확진자수": 39,
        "사망자수": 0,
        "완치자수": 3
    },
    {
        "Name": "레바논",
        "Name_ch": "黎巴嫩",
        "Name_en": "Lebanon",
        "확진자수": 28,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "덴마크",
        "Name_ch": "丹麦",
        "Name_en": "Denmark",
        "확진자수": 27,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "산마리노",
        "Name_ch": "圣马力诺",
        "Name_en": "San Marino",
        "확진자수": 26,
        "사망자수": 1,
        "완치자수": 0
    },
    {
        "Name": "체코",
        "Name_ch": "捷克",
        "Name_en": "Czechia",
        "확진자수": 26,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "이스라엘",
        "Name_ch": "以色列",
        "Name_en": "Israel",
        "확진자수": 25,
        "사망자수": 0,
        "완치자수": 3
    },
    {
        "Name": "포르투갈",
        "Name_ch": "葡萄牙",
        "Name_en": "Portugal",
        "확진자수": 25,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "핀란드",
        "Name_ch": "芬兰",
        "Name_en": "Finland",
        "확진자수": 23,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "베트남",
        "Name_ch": "越南",
        "Name_en": "Vietnam",
        "확진자수": 21,
        "사망자수": 0,
        "완치자수": 16
    },
    {
        "Name": "알제리",
        "Name_ch": "阿尔及利亚",
        "Name_en": "Algeria",
        "확진자수": 19,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "브라질",
        "Name_ch": "巴西",
        "Name_en": "Brazil",
        "확진자수": 19,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "아이슬란드",
        "Name_ch": "爱尔兰",
        "Name_en": "Ireland",
        "확진자수": 19,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "팔레스타인",
        "Name_ch": "巴勒斯坦",
        "Name_en": "Palestine",
        "확진자수": 19,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "오만",
        "Name_ch": "阿曼",
        "Name_en": "Oman",
        "확진자수": 16,
        "사망자수": 0,
        "완치자수": 2
    },
    {
        "Name": "러시아",
        "Name_ch": "俄罗斯",
        "Name_en": "Russia",
        "확진자수": 15,
        "사망자수": 0,
        "완치자수": 3
    },
    {
        "Name": "에콰도르",
        "Name_ch": "厄瓜多尔",
        "Name_en": "Ecuador",
        "확진자수": 14,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "조지아",
        "Name_ch": "格鲁吉亚",
        "Name_en": "Georgia",
        "확진자수": 13,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "루마니아",
        "Name_ch": "尼亚",
        "Name_en": "Romania",
        "확진자수": 13,
        "사망자수": 0,
        "완치자수": 3
    },
    {
        "Name": "크로아티아",
        "Name_ch": "克罗地亚",
        "Name_en": "Croatia",
        "확진자수": 12,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "카타르",
        "Name_ch": "卡塔尔",
        "Name_en": "Qatar",
        "확진자수": 12,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "슬로베니아",
        "Name_ch": "斯洛文尼亚",
        "Name_en": "Slovenia",
        "확진자수": 12,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "사우디아라비아",
        "Name_ch": "沙特阿拉伯",
        "Name_en": "Saudi Arabia",
        "확진자수": 11,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "마카오",
        "Name_ch": "澳门",
        "Name_en": "Macao",
        "확진자수": 10,
        "사망자수": 0,
        "완치자수": 10
    },
    {
        "Name": "에스토니아",
        "Name_ch": "爱沙尼亚",
        "Name_en": "Estonia",
        "확진자수": 10,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Argentina",
        "확진자수": 9,
        "사망자수": 1,
        "완치자수": 0
    },
    {
        "Name": "아제르바이잔",
        "Name_ch": "阿塞拜疆",
        "Name_en": "Azerbaijan",
        "확진자수": 9,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "멕시코",
        "Name_ch": "墨西哥",
        "Name_en": "Mexico",
        "확진자수": 7,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "칠레",
        "Name_ch": "智利",
        "Name_en": "Chile",
        "확진자수": 7,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "필리핀",
        "Name_ch": "菲律宾",
        "Name_en": "Philippines",
        "확진자수": 6,
        "사망자수": 1,
        "완치자수": 2
    },
    {
        "Name": "벨라루스",
        "Name_ch": "白俄罗斯",
        "Name_en": "Belarus",
        "확진자수": 6,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "인도네시아",
        "Name_ch": "印度尼西亚",
        "Name_en": "Indonesia",
        "확진자수": 6,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "파키스탄",
        "Name_ch": "巴基斯坦",
        "Name_en": "Pakistan",
        "확진자수": 6,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "페루",
        "Name_ch": "秘鲁",
        "Name_en": "Peru",
        "확진자수": 6,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "폴란드",
        "Name_ch": "波兰",
        "Name_en": "Poland",
        "확진자수": 6,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "New Zealand",
        "확진자수": 5,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "코스타리카",
        "Name_ch": "哥斯达黎加",
        "Name_en": "Costa Rica",
        "확진자수": 5,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "French Guiana",
        "확진자수": 5,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "헝가리",
        "Name_ch": "匈牙利",
        "Name_en": "Hungary",
        "확진자수": 5,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "아프가니스탄",
        "Name_ch": "阿富汗",
        "Name_en": "Afghanistan",
        "확진자수": 4,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "세네갈",
        "Name_ch": "塞内加尔",
        "Name_en": "Senegal",
        "확진자수": 4,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Bulgaria",
        "확진자수": 4,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "룩셈부르크",
        "Name_ch": "卢森堡",
        "Name_en": "Luxembourg",
        "확진자수": 3,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "North Macedonia",
        "확진자수": 3,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "보스니아 헤르체고비나",
        "Name_ch": "波斯尼亚和黑塞哥维那",
        "Name_en": "Bosnia and Herzegovina",
        "확진자수": 3,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Malta",
        "확진자수": 3,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "슬로바키아",
        "Name_ch": "斯洛伐克",
        "Name_en": "Slovakia",
        "확진자수": 3,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "남아프리카 공화국",
        "Name_ch": "南非共和国",
        "Name_en": "South Africa",
        "확진자수": 3,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "캄보디아",
        "Name_ch": "柬埔寨",
        "Name_en": "Cambodia",
        "확진자수": 2,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "도미니카 공화국",
        "Name_ch": "多明尼加共和国",
        "Name_en": "Dominican Republic",
        "확진자수": 2,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "라트비아",
        "Name_ch": "约旦",
        "Name_en": "Latvia",
        "확진자수": 2,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "모로코",
        "Name_ch": "摩洛哥",
        "Name_en": "Morocco",
        "확진자수": 2,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "카메룬",
        "Name_ch": "喀麦隆",
        "Name_en": "Cameroon",
        "확진자수": 2,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Faeroe Islands",
        "확진자수": 2,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Maldives",
        "확진자수": 2,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "안도라",
        "Name_ch": "安道尔",
        "Name_en": "Andorra",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "아르메니아",
        "Name_ch": "亚美尼亚",
        "Name_en": "Armenia",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "요르단",
        "Name_ch": "约旦",
        "Name_en": "Jordan",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Lithuania",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "모나코",
        "Name_ch": "摩纳哥",
        "Name_en": "Monaco",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "네팔",
        "Name_ch": "尼泊尔",
        "Name_en": "Nepal",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "나이지리아",
        "Name_ch": "尼日利亚",
        "Name_en": "Nigeria",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "스리랑카",
        "Name_ch": "斯里兰卡",
        "Name_en": "Sri Lanka",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 1
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Tunisia",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Ukraine",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "부탄",
        "Name_ch": "不丹",
        "Name_en": "Bhutan",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "콜롬비아",
        "Name_ch": "哥伦比亚",
        "Name_en": "Colombia",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "지브롤터",
        "Name_ch": "直布罗陀",
        "Name_en": "Gibraltar",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Vatican City",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "리히텐슈타인",
        "Name_ch": "列支敦士登",
        "Name_en": "Liechtenstein",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Moldova",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "",
        "Name_ch": "",
        "Name_en": "Paraguay",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "세르비아",
        "Name_ch": "塞尔维亚",
        "Name_en": "Serbia",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    },
    {
        "Name": "토고",
        "Name_ch": "多哥",
        "Name_en": "Togo",
        "확진자수": 1,
        "사망자수": 0,
        "완치자수": 0
    }
];
