var 크롤러_지역별현황 = [
    {
        "지역이름": "부산",
        "확진자수": 96,
        "격리해제수": 10,
        "사망자수": 0,
        "십만명당발생율": 2.81,
        "지역별확진자비율": "1.28"
    },
    {
        "지역이름": "대구",
        "확진자수": 5663,
        "격리해제수": 92,
        "사망자수": 38,
        "십만명당발생율": 232.42,
        "지역별확진자비율": "75.3"
    },
    {
        "지역이름": "인천",
        "확진자수": 13,
        "격리해제수": 3,
        "사망자수": 0,
        "십만명당발생율": 0.44,
        "지역별확진자비율": "0.17"
    },
    {
        "지역이름": "광주",
        "확진자수": 15,
        "격리해제수": 3,
        "사망자수": 0,
        "십만명당발생율": 1.03,
        "지역별확진자비율": "0.2"
    },
    {
        "지역이름": "대전",
        "확진자수": 18,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 1.22,
        "지역별확진자비율": "0.24"
    },
    {
        "지역이름": "울산",
        "확진자수": 24,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 2.09,
        "지역별확진자비율": "0.32"
    },
    {
        "지역이름": "세종",
        "확진자수": 8,
        "격리해제수": 0,
        "사망자수": 0,
        "십만명당발생율": 2.34,
        "지역별확진자비율": "0.11"
    },
    {
        "지역이름": "경기",
        "확진자수": 163,
        "격리해제수": 22,
        "사망자수": 1,
        "십만명당발생율": 1.23,
        "지역별확진자비율": "2.17"
    },
    {
        "지역이름": "강원",
        "확진자수": 28,
        "격리해제수": 6,
        "사망자수": 1,
        "십만명당발생율": 1.82,
        "지역별확진자비율": "0.37"
    },
    {
        "지역이름": "충북",
        "확진자수": 25,
        "격리해제수": 3,
        "사망자수": 0,
        "십만명당발생율": 1.56,
        "지역별확진자비율": "0.33"
    },
    {
        "지역이름": "충남",
        "확진자수": 104,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 4.9,
        "지역별확진자비율": "1.38"
    },
    {
        "지역이름": "전북",
        "확진자수": 7,
        "격리해제수": 2,
        "사망자수": 0,
        "십만명당발생율": 0.39,
        "지역별확진자비율": "0.09"
    },
    {
        "지역이름": "전남",
        "확진자수": 4,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 0.21,
        "지역별확진자비율": "0.05"
    },
    {
        "지역이름": "경북",
        "확진자수": 1117,
        "격리해제수": 60,
        "사망자수": 14,
        "십만명당발생율": 41.95,
        "지역별확진자비율": "14.8"
    },
    {
        "지역이름": "경남",
        "확진자수": 83,
        "격리해제수": 10,
        "사망자수": 0,
        "십만명당발생율": 2.47,
        "지역별확진자비율": "1.1"
    },
    {
        "지역이름": "제주",
        "확진자수": 4,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 0.6,
        "지역별확진자비율": "0.05"
    },
    {
        "업데이트날짜": " 3.10. 00시"
    }
];
