var 크롤러_지역별현황 = [
    {
        "지역이름": "전국",
        "확진자수": 7979,
        "격리해제수": 510,
        "사망자수": 67,
        "십만명당발생율": 15.39,
        "지역별확진자비율": []
    },
    {
        "지역이름": "서울",
        "확진자수": 225,
        "격리해제수": 40,
        "사망자수": 0,
        "십만명당발생율": 2.31,
        "지역별확진자비율": "2.82"
    },
    {
        "지역이름": "부산",
        "확진자수": 100,
        "격리해제수": 36,
        "사망자수": 0,
        "십만명당발생율": 2.93,
        "지역별확진자비율": "1.25"
    },
    {
        "지역이름": "대구",
        "확진자수": 5928,
        "격리해제수": 251,
        "사망자수": 48,
        "십만명당발생율": 243.3,
        "지역별확진자비율": "74.3"
    },
    {
        "지역이름": "인천",
        "확진자수": 27,
        "격리해제수": 4,
        "사망자수": 0,
        "십만명당발생율": 0.91,
        "지역별확진자비율": "0.34"
    },
    {
        "지역이름": "광주",
        "확진자수": 15,
        "격리해제수": 4,
        "사망자수": 0,
        "십만명당발생율": 1.03,
        "지역별확진자비율": "0.19"
    },
    {
        "지역이름": "대전",
        "확진자수": 22,
        "격리해제수": 4,
        "사망자수": 0,
        "십만명당발생율": 1.49,
        "지역별확진자비율": "0.28"
    },
    {
        "지역이름": "울산",
        "확진자수": 27,
        "격리해제수": 3,
        "사망자수": 0,
        "십만명당발생율": 2.35,
        "지역별확진자비율": "0.34"
    },
    {
        "지역이름": "세종",
        "확진자수": 32,
        "격리해제수": 0,
        "사망자수": 0,
        "십만명당발생율": 9.35,
        "지역별확진자비율": "0.4"
    },
    {
        "지역이름": "경기",
        "확진자수": 185,
        "격리해제수": 31,
        "사망자수": 2,
        "십만명당발생율": 1.4,
        "지역별확진자비율": "2.32"
    },
    {
        "지역이름": "강원",
        "확진자수": 29,
        "격리해제수": 6,
        "사망자수": 1,
        "십만명당발생율": 1.88,
        "지역별확진자비율": "0.36"
    },
    {
        "지역이름": "충북",
        "확진자수": 27,
        "격리해제수": 4,
        "사망자수": 0,
        "십만명당발생율": 1.69,
        "지역별확진자비율": "0.34"
    },
    {
        "지역이름": "충남",
        "확진자수": 115,
        "격리해제수": 7,
        "사망자수": 0,
        "십만명당발생율": 5.42,
        "지역별확진자비율": "1.44"
    },
    {
        "지역이름": "전북",
        "확진자수": 7,
        "격리해제수": 4,
        "사망자수": 0,
        "십만명당발생율": 0.39,
        "지역별확진자비율": "0.09"
    },
    {
        "지역이름": "전남",
        "확진자수": 4,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 0.21,
        "지역별확진자비율": "0.05"
    },
    {
        "지역이름": "경북",
        "확진자수": 1147,
        "격리해제수": 103,
        "사망자수": 16,
        "십만명당발생율": 43.08,
        "지역별확진자비율": "14.3"
    },
    {
        "지역이름": "경남",
        "확진자수": 85,
        "격리해제수": 11,
        "사망자수": 0,
        "십만명당발생율": 2.53,
        "지역별확진자비율": "1.07"
    },
    {
        "지역이름": "제주",
        "확진자수": 4,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 0.6,
        "지역별확진자비율": "0.05"
    },
    {
        "업데이트날짜": " 3.13. 00시"
    }
];