var 크롤러_지역별현황 = [
    {
        "지역이름": "부산",
        "확진자수": 98,
        "격리해제수": 21,
        "사망자수": 1,
        "십만명당발생율": 2.87,
        "지역별확진자비율": "1.26"
    },
    {
        "지역이름": "대구",
        "확진자수": 5794,
        "격리해제수": 102,
        "사망자수": 43,
        "십만명당발생율": 237.8,
        "지역별확진자비율": "74.7"
    },
    {
        "지역이름": "인천",
        "확진자수": 25,
        "격리해제수": 3,
        "사망자수": 0,
        "십만명당발생율": 0.85,
        "지역별확진자비율": "0.32"
    },
    {
        "지역이름": "광주",
        "확진자수": 15,
        "격리해제수": 3,
        "사망자수": 0,
        "십만명당발생율": 1.03,
        "지역별확진자비율": "0.19"
    },
    {
        "지역이름": "대전",
        "확진자수": 18,
        "격리해제수": 2,
        "사망자수": 0,
        "십만명당발생율": 1.22,
        "지역별확진자비율": "0.23"
    },
    {
        "지역이름": "울산",
        "확진자수": 25,
        "격리해제수": 2,
        "사망자수": 0,
        "십만명당발생율": 2.18,
        "지역별확진자비율": "0.32"
    },
    {
        "지역이름": "세종",
        "확진자수": 10,
        "격리해제수": 0,
        "사망자수": 0,
        "십만명당발생율": 2.92,
        "지역별확진자비율": "0.13"
    },
    {
        "지역이름": "경기",
        "확진자수": 175,
        "격리해제수": 25,
        "사망자수": 1,
        "십만명당발생율": 1.32,
        "지역별확진자비율": "2.26"
    },
    {
        "지역이름": "강원",
        "확진자수": 29,
        "격리해제수": 6,
        "사망자수": 1,
        "십만명당발생율": 1.88,
        "지역별확진자비율": "0.37"
    },
    {
        "지역이름": "충북",
        "확진자수": 27,
        "격리해제수": 3,
        "사망자수": 0,
        "십만명당발생율": 1.69,
        "지역별확진자비율": "0.35"
    },
    {
        "지역이름": "충남",
        "확진자수": 112,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 5.28,
        "지역별확진자비율": "1.44"
    },
    {
        "지역이름": "전북",
        "확진자수": 7,
        "격리해제수": 2,
        "사망자수": 0,
        "십만명당발생율": 0.39,
        "지역별확진자비율": "0.09"
    },
    {
        "지역이름": "전남",
        "확진자수": 4,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 0.21,
        "지역별확진자비율": "0.05"
    },
    {
        "지역이름": "경북",
        "확진자수": 1135,
        "격리해제수": 69,
        "사망자수": 14,
        "십만명당발생율": 42.63,
        "지역별확진자비율": "14.6"
    },
    {
        "지역이름": "경남",
        "확진자수": 84,
        "격리해제수": 10,
        "사망자수": 0,
        "십만명당발생율": 2.5,
        "지역별확진자비율": "1.08"
    },
    {
        "지역이름": "제주",
        "확진자수": 4,
        "격리해제수": 1,
        "사망자수": 0,
        "십만명당발생율": 0.6,
        "지역별확진자비율": "0.05"
    },
    {
        "업데이트날짜": " 3.11. 00시"
    }
];