var 크롤러_지역별현황 = [
    {
        "지역이름": "서울",
        "확진자수": 120,
        "격리해제수": 29,
        "사망자수": 0
    },
    {
        "지역이름": "부산",
        "확진자수": 96,
        "격리해제수": 10,
        "사망자수": 0
    },
    {
        "지역이름": "대구",
        "확진자수": 5571,
        "격리해제수": 21,
        "사망자수": 35
    },
    {
        "지역이름": "인천",
        "확진자수": 9,
        "격리해제수": 2,
        "사망자수": 0
    },
    {
        "지역이름": "광주",
        "확진자수": 15,
        "격리해제수": 3,
        "사망자수": 0
    },
    {
        "지역이름": "대전",
        "확진자수": 19,
        "격리해제수": 1,
        "사망자수": 0
    },
    {
        "지역이름": "울산",
        "확진자수": 24,
        "격리해제수": 1,
        "사망자수": 0
    },
    {
        "지역이름": "세종",
        "확진자수": 6,
        "격리해제수": 0,
        "사망자수": 0
    },
    {
        "지역이름": "경기",
        "확진자수": 152,
        "격리해제수": 22,
        "사망자수": 1
    },
    {
        "지역이름": "강원",
        "확진자수": 28,
        "격리해제수": 3,
        "사망자수": 1
    },
    {
        "지역이름": "충북",
        "확진자수": 25,
        "격리해제수": 3,
        "사망자수": 0
    },
    {
        "지역이름": "충남",
        "확진자수": 102,
        "격리해제수": 1,
        "사망자수": 0
    },
    {
        "지역이름": "전북",
        "확진자수": 7,
        "격리해제수": 2,
        "사망자수": 0
    },
    {
        "지역이름": "전남",
        "확진자수": 4,
        "격리해제수": 1,
        "사망자수": 0
    },
    {
        "지역이름": "경북",
        "확진자수": 1107,
        "격리해제수": 57,
        "사망자수": 14
    },
    {
        "지역이름": "경남",
        "확진자수": 83,
        "격리해제수": 9,
        "사망자수": 0
    },
    {
        "지역이름": "제주",
        "확진자수": 4,
        "격리해제수": 1,
        "사망자수": 0
    },
    {
        "업데이트날짜": "2020년 3월 9일 00시"
    }
];