var 크롤러_지역별현황 = [
    {
        "지역이름": "서울",
        "확진자수": 120,
        "사망자수": 0
    },
    {
        "지역이름": "부산",
        "확진자수": 97,
        "사망자수": 1
    },
    {
        "지역이름": "대구",
        "확진자수": 5381,
        "사망자수": 35
    },
    {
        "지역이름": "인천",
        "확진자수": 9,
        "사망자수": 0
    },
    {
        "지역이름": "광주",
        "확진자수": 13,
        "사망자수": 0
    },
    {
        "지역이름": "대전",
        "확진자수": 18,
        "사망자수": 0
    },
    {
        "지역이름": "울산",
        "확진자수": 24,
        "사망자수": 0
    },
    {
        "지역이름": "세종",
        "확진자수": 3,
        "사망자수": 0
    },
    {
        "지역이름": "경기",
        "확진자수": 141,
        "사망자수": 1
    },
    {
        "지역이름": "강원",
        "확진자수": 27,
        "사망자수": 1
    },
    {
        "지역이름": "충북",
        "확진자수": 24,
        "사망자수": 0
    },
    {
        "지역이름": "충남",
        "확진자수": 98,
        "사망자수": 0
    },
    {
        "지역이름": "전북",
        "확진자수": 7,
        "사망자수": 0
    },
    {
        "지역이름": "전남",
        "확진자수": 4,
        "사망자수": 0
    },
    {
        "지역이름": "경북",
        "확진자수": 1081,
        "사망자수": 12
    },
    {
        "지역이름": "경남",
        "확진자수": 83,
        "사망자수": 0
    },
    {
        "지역이름": "제주",
        "확진자수": 4,
        "사망자수": 0
    },
    {
        "업데이트날짜": "2020년 3월 8일 00시"
    }
];
